; domain
;; Adapted from: https://github.com/josej30/Planner-Sat-Constraints
;; We use existential preconditions (exists) to remove as many parameters from the actions as possible

(define (domain logistics)

(:requirements :strips :typing :existential-preconditions) 

(:types  city location thing - object
         package vehicle - thing
         truck airplane - vehicle  
         airport - location)
  
(:predicates  (in-city ?l - location ?c - city)
              (at ?obj - thing ?l - location)
              (in ?p - package ?veh - vehicle))
  
(:action drive
         :parameters    (?t - truck ?from ?to - location)
         :precondition  (and 
                             (at ?t ?from)
                             (exists (?c - city)
                                (and (in-city ?from ?c) (in-city ?to ?c))
                              )
                         )
         :effect        (and (not (at ?t ?from))
                             (at ?t ?to)))

(:action fly
         :parameters    (?a - airplane ?from ?to - airport)
         :precondition  (at ?a ?from)
         :effect        (and (not (at ?a ?from))
                             (at ?a ?to)))

(:action load
         :parameters    (?v - vehicle ?p - package ?l - location)
         :precondition  (and (at ?v ?l)
                             (at ?p ?l))
         :effect        (and (not (at ?p ?l))
                             (in ?p ?v)))

(:action unload
         :parameters    (?v - vehicle ?p - package ?l - location)
         :precondition  (and (at ?v ?l)
                             (in ?p ?v))
         :effect        (and (not (in ?p ?v))
                             (at ?p ?l)))

)

; problem
(define (problem problem_87)

(:domain logistics)

(:objects
	obj0 obj3 - airport
	obj1 obj4 - city
	obj2 obj5 obj15 - location
	obj6 obj7 obj8 obj9 - truck
	obj10 obj11 obj12 obj13 - package
	obj14 obj16 - airplane
)

(:init
	(at obj6 obj0)
	(at obj7 obj3)
	(at obj8 obj0)
	(at obj9 obj3)
	(at obj10 obj3)
	(at obj11 obj0)
	(at obj12 obj0)
	(at obj13 obj0)
	(at obj14 obj3)
	(at obj16 obj0)
	(in-city obj0 obj1)
	(in-city obj2 obj1)
	(in-city obj3 obj4)
	(in-city obj5 obj4)
	(in-city obj15 obj1)
)

(:goal (and
	(at obj10 obj2)
	(at obj11 obj5)
	(at obj12 obj5)
	(at obj13 obj5)
))
)

; plan
1. (drive obj6 obj0 obj2)
   deleted: (at obj6 obj0)
   added: (at obj6 obj2)
   goals met: 0 of 4
2. (drive obj8 obj0 obj2)
   deleted: (at obj8 obj0)
   added: (at obj8 obj2)
   goals met: 0 of 4
3. (drive obj9 obj3 obj5)
   deleted: (at obj9 obj3)
   added: (at obj9 obj5)
   goals met: 0 of 4
4. (fly obj16 obj0 obj3)
   deleted: (at obj16 obj0)
   added: (at obj16 obj3)
   goals met: 0 of 4
5. (load obj14 obj10 obj3)
   deleted: (at obj10 obj3)
   added: (in obj10 obj14)
   goals met: 0 of 4
6. (fly obj14 obj3 obj0)
   deleted: (at obj14 obj3)
   added: (at obj14 obj0)
   goals met: 0 of 4
7. (drive obj7 obj3 obj5)
   deleted: (at obj7 obj3)
   added: (at obj7 obj5)
   goals met: 0 of 4
8. (drive obj8 obj2 obj15)
   deleted: (at obj8 obj2)
   added: (at obj8 obj15)
   goals met: 0 of 4
9. (load obj14 obj11 obj0)
   deleted: (at obj11 obj0)
   added: (in obj11 obj14)
   goals met: 0 of 4
10. (load obj14 obj12 obj0)
   deleted: (at obj12 obj0)
   added: (in obj12 obj14)
   goals met: 0 of 4
11. (load obj14 obj13 obj0)
   deleted: (at obj13 obj0)
   added: (in obj13 obj14)
   goals met: 0 of 4
12. (unload obj14 obj10 obj0)
   deleted: (in obj10 obj14)
   added: (at obj10 obj0)
   goals met: 0 of 4
13. (fly obj14 obj0 obj3)
   deleted: (at obj14 obj0)
   added: (at obj14 obj3)
   goals met: 0 of 4
14. (drive obj6 obj2 obj0)
   deleted: (at obj6 obj2)
   added: (at obj6 obj0)
   goals met: 0 of 4
15. (drive obj7 obj5 obj3)
   deleted: (at obj7 obj5)
   added: (at obj7 obj3)
   goals met: 0 of 4
16. (drive obj8 obj15 obj0)
   deleted: (at obj8 obj15)
   added: (at obj8 obj0)
   goals met: 0 of 4
17. (drive obj9 obj5 obj3)
   deleted: (at obj9 obj5)
   added: (at obj9 obj3)
   goals met: 0 of 4
18. (unload obj14 obj11 obj3)
   deleted: (in obj11 obj14)
   added: (at obj11 obj3)
   goals met: 0 of 4
19. (unload obj14 obj12 obj3)
   deleted: (in obj12 obj14)
   added: (at obj12 obj3)
   goals met: 0 of 4
20. (unload obj14 obj13 obj3)
   deleted: (in obj13 obj14)
   added: (at obj13 obj3)
   goals met: 0 of 4
21. (fly obj14 obj3 obj0)
   deleted: (at obj14 obj3)
   added: (at obj14 obj0)
   goals met: 0 of 4
22. (drive obj8 obj0 obj2)
   deleted: (at obj8 obj0)
   added: (at obj8 obj2)
   goals met: 0 of 4
23. (load obj6 obj10 obj0)
   deleted: (at obj10 obj0)
   added: (in obj10 obj6)
   goals met: 0 of 4
24. (load obj7 obj11 obj3)
   deleted: (at obj11 obj3)
   added: (in obj11 obj7)
   goals met: 0 of 4
25. (load obj7 obj12 obj3)
   deleted: (at obj12 obj3)
   added: (in obj12 obj7)
   goals met: 0 of 4
26. (load obj7 obj13 obj3)
   deleted: (at obj13 obj3)
   added: (in obj13 obj7)
   goals met: 0 of 4
27. (drive obj6 obj0 obj2)
   deleted: (at obj6 obj0)
   added: (at obj6 obj2)
   goals met: 0 of 4
28. (drive obj7 obj3 obj5)
   deleted: (at obj7 obj3)
   added: (at obj7 obj5)
   goals met: 0 of 4
29. (drive obj9 obj3 obj5)
   deleted: (at obj9 obj3)
   added: (at obj9 obj5)
   goals met: 0 of 4
30. (unload obj6 obj10 obj2)
   deleted: (in obj10 obj6)
   added: (at obj10 obj2)
   goals met: 1 of 4
31. (unload obj7 obj11 obj5)
   deleted: (in obj11 obj7)
   added: (at obj11 obj5)
   goals met: 2 of 4
32. (unload obj7 obj12 obj5)
   deleted: (in obj12 obj7)
   added: (at obj12 obj5)
   goals met: 3 of 4
33. (unload obj7 obj13 obj5)
   deleted: (in obj13 obj7)
   added: (at obj13 obj5)
   goals met: 4 of 4
